In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('India Sentimental Scores for Reviews.csv')[['Destination_link','Review','Sentiment Score']]

In [3]:
df.head()

,Destination_link,Review,Sentiment Score
0,9376,Thank you for help making my honeymoon a memor...,5
1,9376,Our guide really made the tour great. The dest...,5
2,9376,I really appreciate everything that Travel Tal...,5
3,9376,Overall it was such a surreal and fun experien...,4
4,9376,I really enjoyed me tour it was excellent. I m...,5

In [9]:
df.groupby('Sentiment Score').count()['Review']

Sentiment Score
1      17
2      57
3      57
4     238
5    1696
Name: Review, dtype: int64

In [4]:
df1 = pd.read_csv('USA Sentimental Scores for Reviews.csv')[['Destination_link', 'Review', 'Sentiment Score']]
df1.head()

,Destination_link,Review,Sentiment Score
0,93960,Had a great week and we were so blessed to hav...,5
1,93960,Stunning places! Our tour guide was very infor...,5
2,93960,Our Chief Experience Officer Brianna Collins m...,5
3,93960,"Rachel is great, so well organized, patient, n...",5
4,93960,It was awesome. We did alot of different activ...,5

In [5]:
df1 = df1[df1['Sentiment Score'] <= 3]

In [6]:
final_df = pd.concat([df,df1], axis = 0)

In [7]:
final_df.shape

(2202, 3)

In [8]:
final_df.groupby('Sentiment Score').count()['Review']

Sentiment Score
1      47
2      92
3     129
4     238
5    1696
Name: Review, dtype: int64

In [10]:
df2 = pd.read_csv('NorwayReviewScore.csv')
df2.head()

   Destination_link                                             Review  Scores
0            129511  Norway was beautiful! The Guide and driver wer...       5
1            129511               Excellent thanks for the memories!!!       5
2            129511  A very good and enjoyable tour led by an excel...       4
3            129511  The trip itself is amazing: covers the most be...       5
4            129511  Our tour guide, Øivind, could not have been be...       5

In [11]:
df2 = df2.rename(columns={"Scores": "Sentiment Score"})
df2.head()

,Destination_link,Review,Sentiment Score
0,129511,Norway was beautiful! The Guide and driver wer...,5
1,129511,Excellent thanks for the memories!!!,5
2,129511,A very good and enjoyable tour led by an excel...,4
3,129511,The trip itself is amazing: covers the most be...,5
4,129511,"Our tour guide, Øivind, could not have been be...",5

In [12]:
df2 = df2[df2['Sentiment Score'] <= 4]
df2

,Destination_link,Review,Sentiment Score
2,129511,A very good and enjoyable tour led by an excel...,4
7,129511,"On the go, but we enjoyed sumptuous buffet bre...",4
8,129511,"Found the guide to be very organized, on sched...",4
11,115430,Would love options for hotel and clear explana...,3
12,115430,"The tour itself was great, but the description...",3
...,...,...,...
247,231551,"Our guide was pleasant, helpful, easy to get a...",3
252,240476,"The cabins were nice, the staff were very good...",4
253,240476,The tour was very well executed and the only c...,4
254,132517,This tour was something new for my family (4 p...,4
256,205805,"Our guide was pleasant, helpful, easy to get a...",3

In [13]:
final_df = pd.concat([final_df,df2], axis = 0)

In [14]:
final_df.groupby('Sentiment Score').count()['Review']

Sentiment Score
1      53
2     102
3     150
4     282
5    1696
Name: Review, dtype: int64

In [15]:
df3 = pd.read_csv('Srilamka Sentimental Scores for Reviews.csv')
df3.head()

,Unnamed: 0.1,index,Unnamed: 0,Destination_link,Review,Sentiment Score
0,0,0,0,119449,Awesome experience. The tour was very balanced...,5
1,1,1,1,119449,I’ve just had the most amazing 12 days in Sri ...,5
2,2,2,2,119449,Best tour I’ve been on by far! (And I’ve done ...,5
3,3,3,3,119449,"A well organised and fun tour, in an incredibl...",4
4,4,4,4,119449,I had the most amazing trip to Sri Lanka. This...,5

In [16]:
df3 = df3[df3['Sentiment Score'] <= 4]
df3

,Unnamed: 0.1,index,Unnamed: 0,Destination_link,Review,Sentiment Score
3,3,3,3,119449,"A well organised and fun tour, in an incredibl...",4
11,11,11,11,98680,The tour itself was very varied and super plan...,4
19,19,19,19,98680,"Das es sich sehr lohnt, da man viel sieht. Abe...",3
20,20,20,20,82881,I'm only giving two stars because the guide an...,2
21,21,21,21,82881,The tour was perfect for my needs. Day in Kand...,3
...,...,...,...,...,...,...
1322,1322,1322,1322,238721,The hotels were nice. The last Hotel was very ...,4
1325,1325,1325,1325,238595,The hotels were nice. The last Hotel was very ...,4
1329,1329,1329,1329,178583,We booked a 7 days tour around the island with...,4
1335,1335,1335,1335,178583,Myself and my sister were part of the tour in ...,4
1349,1349,1349,1349,226528,"Interesting place, but some of the infrastruct...",3

In [17]:
df3.groupby('Sentiment Score').count()['Review']

Sentiment Score
1     19
2     25
3     62
4    160
Name: Review, dtype: int64

In [18]:
final_df = pd.concat([final_df,df3], axis = 0)
final_df.groupby('Sentiment Score').count()['Review']

Sentiment Score
1      72
2     127
3     212
4     442
5    1696
Name: Review, dtype: int64

In [19]:
df1 = pd.read_csv('Canada Sentimental Scores for Reviews.csv')[['Destination_link', 'Review', 'Sentiment Score']]
df1.head()

,Destination_link,Review,Sentiment Score
0,82244,x ...,5
1,82244,"It was a great tour, well executed!",5
2,82244,Knowledgeable tour guide - excellent bus drive...,5
3,82244,We appreciated seeing the snow-covered Rocky M...,5
4,82244,"Great time very good ,guide and driver",5

In [20]:
df1 = df1[df1['Sentiment Score'] <= 4]
df1

,Destination_link,Review,Sentiment Score
6,82244,This review rating is about my experiences wit...,2
7,82244,This rating is a review of Tour Radar and my e...,3
9,82244,The trip of a lifetime. Very sad for it to end.,2
11,178350,Our tour guide and group were amazing. He was ...,2
23,98838,Our tour guide jafar took us of the beaten tra...,4
...,...,...,...
1344,183657,This was our first tour and we enjoyed it very...,4
1345,183657,Cosmos favoured those who bought tickets for m...,2
1346,183657,"The tour , the guide and the driver was exelen...",4
1351,84186,Trip interrupted by COVID. Trying to reach som...,1
1353,84186,"Great scenery, tour director, coach driver, lo...",3

In [22]:
df1[df1['Sentiment Score'] <= 1]

,Destination_link,Review,Sentiment Score
168,82330,"Do not include Ottawa as a tour site, it was a...",1
192,51555,The lake cruise was cancelled due to weather c...,1
200,106388,This tour was an amazing adventure. First time...,1
204,106388,Go!!!! I have convinced my cousin and she can’...,1
215,51558,The lake cruise was cancelled due to weather c...,1
387,199077,Trip interrupted by COVID. Trying to reach som...,1
411,216588,Definitely do not recommend. Was not worth all...,1
484,52279,"Cosmos tour Western Canada, inside passage. M...",1
503,124825,This tour was not as advertised and was a poor...,1
519,209297,Trip interrupted by COVID. Trying to reach som...,1
537,78145,This tour was terrible. While the website stat...,1
539,84454,"Cosmos tour Western Canada, inside passage. M...",1
548,114881,The motel we stayed at (Days Inn) did not have...,1
583,218964,Do not travel with this company! We booked bo...,1
629,83738,The lake cruise was cancelled due to weather c...,1
767,218962,Do not travel with this company! We booked bo...,1
856,221883,Do not travel with this company! We booked bo...,1
861,221857,Do not travel with this company! We booked bo...,1
901,205210,"Do not include Ottawa as a tour site, it was a...",1
916,186488,Very poor tour leader and all main attractions...,1
1070,240295,"Do not include Ottawa as a tour site, it was a...",1
1182,100130,Unforgettable experiences!!!,1
1250,221858,Do not travel with this company! We booked bo...,1
1351,84186,Trip interrupted by COVID. Trying to reach som...,1

In [26]:
len(df1[df1['Sentiment Score'] == 2])

44

In [21]:
final_df = pd.concat([final_df,df1], axis = 0)
final_df.groupby('Sentiment Score').count()['Review']

Sentiment Score
1      96
2     171
3     315
4     748
5    1696
Name: Review, dtype: int64

In [27]:
final_df.shape

(3026, 6)

### Let's make the final df with each category have 200 records

In [39]:
df1 = final_df[final_df['Sentiment Score'] == 1][['Destination_link', 'Review', 'Sentiment Score']]
print(df1.shape)
df1.head()

(96, 3)

,Destination_link,Review,Sentiment Score
222,158815,I agree with previous reviews: Swastik must p...,1
275,136983,An incredible trip - shame it was only 8 days!...,1
376,111427,I like whole experience but Jaipur. Elephant v...,1
675,80984,The tour has many extra payments that you are ...,1
680,80984,The guide us Delhi was horrible. His facts we...,1

In [40]:
df2 = final_df[final_df['Sentiment Score'] == 2][['Destination_link', 'Review', 'Sentiment Score']]
print(df2.shape)
df2.head()

(171, 3)

,Destination_link,Review,Sentiment Score
51,113375,Unfortunately due to the cornavirus and the ca...,2
76,116073,The only thing is guides took us to most expen...,2
82,5518,"There's a lot of wasted time on this tour, bot...",2
124,2580,I would love to say this tour was a great intr...,2
134,105050,I found Bout India through an internet search....,2

In [51]:
df3 = final_df[final_df['Sentiment Score'] == 3][['Destination_link', 'Review', 'Sentiment Score']]
print(df3.shape)
df3.head()

(315, 3)

,Destination_link,Review,Sentiment Score
18,5505,Overall a good experience. With the exception...,3
37,88881,I firstly have to say the driver Pramod has be...,3
44,110498,"Ajit Singh, my driver, was very considerate an...",3
52,113375,Guides and drivers were very good. Hotels had ...,3
103,62422,This trip was challenging. The overall itinera...,3

In [52]:
df3 = df3.iloc[:250]
df3.shape

(250, 3)

In [53]:
df4 = final_df[final_df['Sentiment Score'] == 4][['Destination_link', 'Review', 'Sentiment Score']]
print(df4.shape)
df4.head()

(748, 3)

,Destination_link,Review,Sentiment Score
3,9376,Overall it was such a surreal and fun experien...,4
5,9376,Was one of the best tours I’ve ever joined. Th...,4
8,9376,The tour covers the basics but myself and frie...,4
9,9376,My Fiancé and I did the 8-day golden triangle ...,4
13,5505,I had a great experience. Overall enjoyed the ...,4

In [54]:
df4 = df4.iloc[:250]
df4.shape

(250, 3)

In [55]:
df5 = final_df[final_df['Sentiment Score'] == 5][['Destination_link', 'Review', 'Sentiment Score']]
print(df5.shape)
df5.head()

(1696, 3)

,Destination_link,Review,Sentiment Score
0,9376,Thank you for help making my honeymoon a memor...,5
1,9376,Our guide really made the tour great. The dest...,5
2,9376,I really appreciate everything that Travel Tal...,5
4,9376,I really enjoyed me tour it was excellent. I m...,5
6,9376,"So many wonderful places visited in 8 days , w...",5

In [56]:
df5 = df5.iloc[:250]
df5.shape

(250, 3)

### Combine them all into One Data Frame

In [57]:
df = pd.concat([df1,df2,df3,df4,df5], axis = 0)
df.head()

,Destination_link,Review,Sentiment Score
222,158815,I agree with previous reviews: Swastik must p...,1
275,136983,An incredible trip - shame it was only 8 days!...,1
376,111427,I like whole experience but Jaipur. Elephant v...,1
675,80984,The tour has many extra payments that you are ...,1
680,80984,The guide us Delhi was horrible. His facts we...,1

In [58]:
df.shape

(1017, 3)

In [60]:
df.to_csv('Review Balanced Data set.csv')